In [4]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [5]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
type(obj.values)

numpy.ndarray

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([4,7,-5,3], index = list('dbac'))

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [12]:
obj2['a']

-5

In [13]:
obj2['d']

4

In [14]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[['c','b','a']]

c    3
b    7
a   -5
dtype: int64

In [16]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [17]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [18]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [19]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

In [22]:
state = {'Ohio':35000,'Texas':75000,'Oregan':16000, 'Utah': 5000}
state

{'Ohio': 35000, 'Oregan': 16000, 'Texas': 75000, 'Utah': 5000}

In [23]:
obj3 = Series(state)

In [24]:
obj3

Ohio      35000
Oregan    16000
Texas     75000
Utah       5000
dtype: int64

In [25]:
states = 'California Ohio Oregan Texas'.split()
states

['California', 'Ohio', 'Oregan', 'Texas']

In [26]:
obj4 = Series(state,index = states)

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregan        16000.0
Texas         75000.0
dtype: float64

In [28]:
pd.isnull(obj4)

California     True
Ohio          False
Oregan        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregan         True
Texas          True
dtype: bool

In [30]:
obj4.isnull()

California     True
Ohio          False
Oregan        False
Texas         False
dtype: bool

In [31]:
obj4.notnull()

California    False
Ohio           True
Oregan         True
Texas          True
dtype: bool

In [32]:
obj4.isna()

California     True
Ohio          False
Oregan        False
Texas         False
dtype: bool

In [33]:
obj4.isna() == obj4.isnull()

California    True
Ohio          True
Oregan        True
Texas         True
dtype: bool

### Automatic alignment by index when doing arithmentics

In [34]:
obj3
obj4

Ohio      35000
Oregan    16000
Texas     75000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregan        16000.0
Texas         75000.0
dtype: float64

In [35]:
obj3 +obj4

California         NaN
Ohio           70000.0
Oregan         32000.0
Texas         150000.0
Utah               NaN
dtype: float64

In [36]:
obj4.name = 'population'

In [37]:
obj4.index.name = 'state'

In [38]:
obj4

state
California        NaN
Ohio          35000.0
Oregan        16000.0
Texas         75000.0
Name: population, dtype: float64

In [39]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [40]:
obj.index = 'Bob Steve Jeff Ryan'.split()

In [41]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrames

In [42]:
data = {'state':('Ohio '*3+'Nevada '*3).split(),
       'year':2*[2000,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [43]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2000, 2001, 2002]}

In [44]:
frame = DataFrame(data)

In [45]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2000
4  2.9  Nevada  2001
5  3.2  Nevada  2002

In [46]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2000  Nevada  2.4
4  2001  Nevada  2.9
5  2002  Nevada  3.2

In [47]:
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'], index = 'one two three four five six'.split())
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2000  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN
six    2002  Nevada  3.2  NaN

In [48]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [49]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [50]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

### SQL join behavior when asigning a series to a column

In [51]:
val = pd.Series([-1.2,-1.6,-1.3], index = 'two five six'.split())
val

two    -1.2
five   -1.6
six    -1.3
dtype: float64

In [52]:
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2000  Nevada  2.4   NaN
five   2001  Nevada  2.9  -1.6
six    2002  Nevada  3.2  -1.3

### Another comon way of creating DataFrames is nested dicts:

In [53]:
pop = {'Nevada':{2001:2.4,2002:2.5},
      'Ohio':{2001:1.5, 2002:1.6, 2003: 3.6},
      'New York':{x:y for (x,y) in zip(range(2001,2006),range(5))}}

In [54]:
pop

{'Nevada': {2001: 2.4, 2002: 2.5},
 'New York': {2001: 0, 2002: 1, 2003: 2, 2004: 3, 2005: 4},
 'Ohio': {2001: 1.5, 2002: 1.6, 2003: 3.6}}

In [55]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  New York  Ohio
2001     2.4         0   1.5
2002     2.5         1   1.6
2003     NaN         2   3.6
2004     NaN         3   NaN
2005     NaN         4   NaN

In [56]:
frame3.T

          2001  2002  2003  2004  2005
Nevada     2.4   2.5   NaN   NaN   NaN
New York   0.0   1.0   2.0   3.0   4.0
Ohio       1.5   1.6   3.6   NaN   NaN

In [57]:
frame3

      Nevada  New York  Ohio
2001     2.4         0   1.5
2002     2.5         1   1.6
2003     NaN         2   3.6
2004     NaN         3   NaN
2005     NaN         4   NaN

In [58]:
frame3['New York'].name = None

In [59]:
frame3

      Nevada  New York  Ohio
2001     2.4         0   1.5
2002     2.5         1   1.6
2003     NaN         2   3.6
2004     NaN         3   NaN
2005     NaN         4   NaN

In [60]:
frame3.columns

Index([u'Nevada', u'New York', u'Ohio'], dtype='object')

In [61]:
frame3['New York'].name = 'New_York'

In [62]:
frame3.Nevada

2001    2.4
2002    2.5
2003    NaN
2004    NaN
2005    NaN
Name: Nevada, dtype: float64

In [63]:
frame3.columns = 'Nevada New_York Ohio'.split()

In [64]:
frame3.index

Int64Index([2001, 2002, 2003, 2004, 2005], dtype='int64')

### Pandas Index object
a set like object, immutable, unlike sets, can contain duplicates.

In [65]:
ind1 = frame3.index

In [66]:
ind2 = pd.Index([2001,2010,2011])
ind2

Int64Index([2001, 2010, 2011], dtype='int64')

In [67]:
ind3 = ind1.append(ind2)
ind3

Int64Index([2001, 2002, 2003, 2004, 2005, 2001, 2010, 2011], dtype='int64')

In [68]:
2001 in ind3

True

In [69]:
ind2.difference(ind1)

Int64Index([2010, 2011], dtype='int64')

In [70]:
ind1.difference(ind2)

Int64Index([2002, 2003, 2004, 2005], dtype='int64')

In [71]:
ind3

Int64Index([2001, 2002, 2003, 2004, 2005, 2001, 2010, 2011], dtype='int64')

In [72]:
ind3.insert(5,2006)

Int64Index([2001, 2002, 2003, 2004, 2005, 2006, 2001, 2010, 2011], dtype='int64')

In [73]:
ind3.is_monotonic

False

In [74]:
ind3.unique()

Int64Index([2001, 2002, 2003, 2004, 2005, 2010, 2011], dtype='int64')

In [75]:
obj3

Ohio      35000
Oregan    16000
Texas     75000
Utah       5000
dtype: int64

In [76]:
frame3

      Nevada  New_York  Ohio
2001     2.4         0   1.5
2002     2.5         1   1.6
2003     NaN         2   3.6
2004     NaN         3   NaN
2005     NaN         4   NaN

In [77]:
frame3.index

Int64Index([2001, 2002, 2003, 2004, 2005], dtype='int64')

In [78]:
# frame3.index = ind3.insert(5,2006) # will nor work
frame4 = frame3.reindex(ind3.insert(5,2006)) # introduces a duplicate index (row)
frame4

      Nevada  New_York  Ohio
2001     2.4       0.0   1.5
2002     2.5       1.0   1.6
2003     NaN       2.0   3.6
2004     NaN       3.0   NaN
2005     NaN       4.0   NaN
2006     NaN       NaN   NaN
2001     2.4       0.0   1.5
2010     NaN       NaN   NaN
2011     NaN       NaN   NaN

In [79]:
frame4['New_York']

2001    0.0
2002    1.0
2003    2.0
2004    3.0
2005    4.0
2006    NaN
2001    0.0
2010    NaN
2011    NaN
Name: New_York, dtype: float64

In [80]:
frame4.loc[2001] # call a row with index name

      Nevada  New_York  Ohio
2001     2.4       0.0   1.5
2001     2.4       0.0   1.5

In [81]:
frame4.iloc[5] # call a row with index number

Nevada     NaN
New_York   NaN
Ohio       NaN
Name: 2006, dtype: float64

In [82]:
# reindexing is one of the way to go when we want to rearrange the order of apperience of columns in DataFrames
frame4.reindex(columns = 'New_York Nevada Ohio'.split())

      New_York  Nevada  Ohio
2001       0.0     2.4   1.5
2002       1.0     2.5   1.6
2003       2.0     NaN   3.6
2004       3.0     NaN   NaN
2005       4.0     NaN   NaN
2006       NaN     NaN   NaN
2001       0.0     2.4   1.5
2010       NaN     NaN   NaN
2011       NaN     NaN   NaN

In [83]:
# another way is to use loc.
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = list('acd'),
                    columns = 'Ohio Texas California'.split())
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [84]:
frame2 = frame.reindex(list('abcd'))
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [85]:
states = 'Texas Utah California'.split()

### Page 138 table 5-3 _reindex_ function arguments

In [86]:
frame.reindex(columns=states,index=['a','b','c','d'],fill_value = 100)

   Texas  Utah  California
a      1   100           2
b    100   100         100
c      4   100           5
d      7   100           8

### Dropping Entries from an Axis

In [87]:
obj = Series(np.arange(5.),index = list('abcde'))
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [88]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [89]:
obj.drop(['b','d'])

a    0.0
c    2.0
e    4.0
dtype: float64

In [90]:
data  = pd.DataFrame(np.arange(16).reshape(4,4),
                     columns = 'one two three four'.split(),
                     index = 'Ohio Colorado Utah New_York'.split())

In [91]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New_York   12   13     14    15

In [92]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New_York   12   13     14    15

In [93]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New_York   12     14    15

In [94]:
data.drop(['two','four'],axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New_York   12     14

In [95]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New_York   12   13     14    15

#### Shortcut
to drop selected index or columns, we can simply pass the following

In [96]:
data.drop(columns = ['three','four'])

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New_York   12   13

Here, I am trying to find a way to drop columns or indices using their numeric location, not the labels.
Suppose I want to drop every other row without passing row lables. How would I do it?

In [97]:
data.index

Index([u'Ohio', u'Colorado', u'Utah', u'New_York'], dtype='object')

In [98]:
data.index[1]

'Colorado'

In [99]:
data.index[1:3]

Index([u'Colorado', u'Utah'], dtype='object')

In [100]:
data.index[::2]

Index([u'Ohio', u'Utah'], dtype='object')

In [101]:
data.drop(index=data.index[::2])

          one  two  three  four
Colorado    4    5      6     7
New_York   12   13     14    15

#### Indexing

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New_York   12   13     14    15

In [103]:
data[:2] # this is a row selection convenience.
# passing a single element or a list to [] operator selects columns.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [104]:
data['two']

Ohio         1
Colorado     5
Utah         9
New_York    13
Name: two, dtype: int64

In [105]:
data[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New_York   13    15

In [106]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New_York  False  False  False  False

In [107]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New_York  NaN  NaN    NaN   NaN

In [108]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New_York   12   13     14    15

### Sekection with loc and iloc (page 143)

In [109]:
data.loc['Colorado', ['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [110]:
data.iloc[2,[3,0,2]]

four     11
one       8
three    10
Name: Utah, dtype: int64

In [111]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [112]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New_York   12   13     14    15

In [113]:
data.iloc[[1,3],[3,0,2]]

          four  one  three
Colorado     7    4      6
New_York    15   12     14

Both indexing functions work with slices in addition to singe labels or list of labels.

In [114]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [115]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New_York   12   13     14

### See 'Indexing options with DataFrames' table on page 144

In [116]:
data[['three','two']]

          three  two
Ohio          2    1
Colorado      6    5
Utah         10    9
New_York     14   13